starter/app/Models/ModelOtentikasi.php

    function getEmail($email)
    {
        $builder = $this->table("users");
        $data = $builder->where("email", $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sample@gmail.com'
 LIMIT 1