starter/app/Models/ModelTracking.php

SELECT *
FROM `v_tracking`
WHERE `to` = 'SDB.3.1'
---
    function getTrackingByRole($role)
    {
        $builder = $this->table("v_tracking");
        $builder->where("to", $role);
        $builder->orWhere("isUnknown", 'N');
       $data =  $builder->get()->getResult();