starter/app/Models/ModelEmployee.php

    function getEmployeeByParent($roleCode,$roleLevel){
        $builder = $this->table("v_employee");
        $builder->where("parent", $roleCode);
       $data =  $builder->get()->getResult();
---
SELECT *
FROM `v_employee`
WHERE `parent` = 'SDB.3.0'