starter/app/Models/ModelMasterDataLookup.php

SELECT *
FROM `v_masterdatalookup`
WHERE `type` = 'LEVEL'
---
    function getMasterDataLookup($type)
    {
        $builder = $this->table("v_masterdatalookup");
         $builder->whereIn("type", $type);
        $data =  $builder->get()->getResult();