starter/app/Models/ModelOtentikasi.php

    function getEmployee($employeeId,$password)
    {
        $builder = $this->table("v_access");
        $data = $builder->where("employeeId", $employeeId)->first();
---
SELECT *
FROM `v_access`
WHERE `employeeId` = '198412192009021001'
 LIMIT 1